package org.venus.dsl;

public class RuleCase {

    public static final String chestCTExaminationRule =
            "ct_rule \"胸部CT检查是否阳性\"\n" +
            "\n" +
            "rule_group_1 \"胸部CT检查\"\n" +
            "r1 ${检查项目类型} = \"CT\"\n" +
            "r2 ${检查项目类型存在状态} = \"确定\"\n" +
            "r3 ${检查部位} = \"胸部\"\n" +
            "r4 ${病灶部位} = \"胸部\"; ${病灶存在状态} in {\"确定\", \"疑似\", \"拟\"}\n" +
            "r5 ${检查部位} not_contains \"胸部\"\n" +
            "r6 ${检查部位} contains \"腹部\"\n" +
            "r7 ${病灶部位} = \"肺\"; ${病灶存在状态} in {\"确定\", \"疑似\", \"拟\"}\n" +
            "满足 (r1 and r2 and r3) or ((r1 and r2 and r4) and not (r5 and r6 and r7)) 输出 \"是\"\n" +
            "其他输出 \"否\"\n" +
            "\n" +
            "rule_group_2 \"检查结果阳性\"\n" +
            "r4 ${病灶描述} in {\"结节\", \"肿物\", \"占位\"}\n" +
            "r5 ${病灶密度} in {\"实性\", \"非实性\", \"部分实性\"}\n" +
            "r6 ${病灶部位} = \"支气管\"; ${病灶存在状态} in {\"确定\", \"疑似\", \"拟\"}\n" +
            "r7 ${病灶描述} in {\"闭塞\", \"狭窄\", \"不规则\", \"粘液栓\"}\n" +
            "r8 ${病灶部位} = \"支气管壁\"\n" +
            "r9 ${病灶部位变化情况} = \"增厚\"\n" +
            "r10 ${病灶部位} = \"肺门\"; ${病灶存在状态} in {\"确定\", \"疑似\", \"拟\"}\n" +
            "r11 ${病灶描述} = \"软组织影\"\n" +
            "r12 ${病灶部位} = \"肺\"; ${病灶存在状态} in {\"确定\", \"疑似\", \"拟\"}\n" +
            "r13 ${诊断名称} in {\"慢阻肺诊断\", \"阻塞性肺部炎症诊断\"}; ${诊断存在状态} in {\"确定\", \"疑似\", \"拟\"}\n" +
            "r14 ${诊断名称} = {\"肺不张诊断\"}; ${诊断存在状态} in {\"确定\", \"疑似\", \"拟\"}\n" +
            "满足 (r4 and r5 and (r6 or r12)) or (r6 and r7) or (r8 and r9) or (r10 and r11) or ( r12 and r13) or r14 输出 \"是\"\n" +
            "其他输出 \"否\"\n" +
            "\n" +
            "\n" +
            "rule_group_3 \"检查结果时间满足当次就诊期间\"\n" +
            "r1 ${检查结果时间} >= ${就诊时间}\n" +
            "满足 r1 输出 \"是\"\n" +
            "其他输出 \"否\"\n" +
            "\n" +
            "{\n" +
            "\t满足 rule_group_2 输出 \"是\"\n" +
            "\t其他输出 \"否\"\n" +
            "}\n";

}
